In [60]:
#This is for learn pandas
import pandas as pd
d = pd.read_csv("http://bit.ly/drinksbycountry")
#显示前几行
d.head(6)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America

In [78]:
d.describe()
d[d.country == "China"]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
36,China,79,192,8,5.0,Asia

In [61]:
d.drop('continent', axis=1).head()
d.drop('continent', axis='columns').head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [ ]:
d.mean(axis=0)
d.mean(axis='index')

In [69]:
#string method
d.country.str.replace('[A, a]', '+')
for i in d.country.str.contains('China'):
    if i:
        print "yes"

In [ ]:
#change data type
d['beer_servings'] = d.beer_servings.astype(float)
d.dtypes